<template>
  <div>
    <button @click="show = true">Click {{ show }}</button>
    <Modal exit-animation="fade-out-left-big" :show="show" @close="show = false">
      <div class="p">
        Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на
        русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы
        использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в
        абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия.
      </div>
    </Modal>
  </div>
</template>

<script>
export default {
  props: {},
  data() {
    return {
      show: false
    }
  },
  methods: {}
}
</script>
